In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                   'key2':['one','two','one','two','one'],
                   'data1':np.random.randn(5),
                   'data2': np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.745822  0.521047
1    a  two -0.225377 -2.100872
2    b  one  0.153277 -0.323817
3    b  two -0.676431 -1.235620
4    a  one  0.640857  0.222357

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a    0.387101
b   -0.261577
Name: data1, dtype: float64

In [8]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [9]:
means

key1  key2
a     one     0.693339
      two    -0.225377
b     one     0.153277
      two    -0.676431
Name: data1, dtype: float64

In [10]:
means.unstack()

key2       one       two
key1
a     0.693339 -0.225377
b     0.153277 -0.676431

In [11]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])

In [12]:
years = np.array([2005,2005,2006,2005,2006])

In [13]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.225377
            2006    0.153277
Ohio        2005    0.034696
            2006    0.640857
Name: data1, dtype: float64

In [15]:
df

  key1 key2     data1     data2
0    a  one  0.745822  0.521047
1    a  two -0.225377 -2.100872
2    b  one  0.153277 -0.323817
3    b  two -0.676431 -1.235620
4    a  one  0.640857  0.222357

In [22]:
df[['data1','data2','key1']].groupby('key1').mean()

         data1     data2
key1
a     0.387101 -0.452490
b    -0.261577 -0.779719

In [23]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.693339  0.371702
     two  -0.225377 -2.100872
b    one   0.153277 -0.323817
     two  -0.676431 -1.235620

In [24]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [33]:
newdf = pd.DataFrame(np.random.randn(15,4),
                     columns=pd.Index(['A','B','C','D'],name='type'))
newdf['key'] = pd.Series(list('abcddaccbcacdda'))

In [37]:
list(newdf.groupby('key',))

[('a',
  type         A         B         C         D key
  0     1.277453  0.802524  0.020929  0.812535   a
  5    -0.068755 -0.561344  0.134838  0.007631   a
  10   -0.895589  1.162935  0.396754  0.176198   a
  14    0.073345 -0.377411 -0.353291  0.827744   a),
 ('b',
  type         A         B         C         D key
  1    -0.898266  0.457785  1.058266 -1.586968   b
  8     1.141202 -1.597342  1.096520 -0.131455   b),
 ('c',
  type         A         B         C         D key
  2    -0.023000  0.970850 -0.090775  0.705151   c
  6     1.349235  0.060268 -1.503240  0.961807   c
  7    -1.181273  0.308961 -0.228417 -0.951672   c
  9    -0.240782 -1.139547  1.530888 -2.351536   c
  11   -1.461203  1.480711 -0.725081  0.801281   c),
 ('d',
  type         A         B         C         D key
  3    -0.645950 -0.200809  0.364636 -1.365297   d
  4    -0.771640  1.288032  2.024391  0.549979   d
  12   -1.219382  0.182001  0.028550 -0.830756   d
  13   -0.001765  1.584154 -1.026046 -1.250475   d)]

In [40]:
newdf.groupby('key').size()

key
a    4
b    2
c    5
d    4
dtype: int64

In [41]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.745822  0.521047
1    a  two -0.225377 -2.100872
4    a  one  0.640857  0.222357
b
  key1 key2     data1     data2
2    b  one  0.153277 -0.323817
3    b  two -0.676431 -1.235620

In [42]:
list(df.groupby(['key1','key2']))

[(('a', 'one'),
    key1 key2     data1     data2
  0    a  one  0.745822  0.521047
  4    a  one  0.640857  0.222357),
 (('a', 'two'),
    key1 key2     data1     data2
  1    a  two -0.225377 -2.100872),
 (('b', 'one'),
    key1 key2     data1     data2
  2    b  one  0.153277 -0.323817),
 (('b', 'two'),
    key1 key2     data1    data2
  3    b  two -0.676431 -1.23562)]

In [43]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.745822  0.521047
4    a  one  0.640857  0.222357
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.225377 -2.100872
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.153277 -0.323817
('b', 'two')
  key1 key2     data1    data2
3    b  two -0.676431 -1.23562

In [44]:
pieces = dict(list(df.groupby('key1')))

In [45]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.153277 -0.323817
3    b  two -0.676431 -1.235620

In [46]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [47]:
grouped = df.groupby(df.dtypes,axis=1)

In [48]:
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.745822  0.521047
1 -0.225377 -2.100872
2  0.153277 -0.323817
3 -0.676431 -1.235620
4  0.640857  0.222357
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [49]:
list(grouped)

[(dtype('float64'),
        data1     data2
  0  0.745822  0.521047
  1 -0.225377 -2.100872
  2  0.153277 -0.323817
  3 -0.676431 -1.235620
  4  0.640857  0.222357),
 (dtype('O'),
    key1 key2
  0    a  one
  1    a  two
  2    b  one
  3    b  two
  4    a  one)]

In [50]:
df.groupby('key1')['data1']

In [51]:
df.groupby('key1')[['data2']]

In [52]:
df['data1'].groupby(df['key1'])

In [53]:
df[['data2']].groupby(df['key1'])

In [57]:
df.groupby(['key1','key2'])['data2'].mean()

key1  key2
a     one     0.371702
      two    -2.100872
b     one    -0.323817
      two    -1.235620
Name: data2, dtype: float64

In [63]:
s_grouped = df.groupby(['key1','key2'])[['data2','data1']]

In [61]:
s_grouped

In [64]:
s_grouped.mean()

              data2     data1
key1 key2
a    one   0.371702  0.693339
     two  -2.100872 -0.225377
b    one  -0.323817  0.153277
     two  -1.235620 -0.676431

In [65]:
list(s_grouped)

[(('a', 'one'),
        data2     data1
  0  0.521047  0.745822
  4  0.222357  0.640857),
 (('a', 'two'),
        data2     data1
  1 -2.100872 -0.225377),
 (('b', 'one'),
        data2     data1
  2 -0.323817  0.153277),
 (('b', 'two'),
       data2     data1
  3 -1.23562 -0.676431)]

In [67]:
for name,group in df['data1'].groupby([df['key1']]):
    print(name)
    print(group)

('a',)
0    0.745822
1   -0.225377
4    0.640857
Name: data1, dtype: float64
('b',)
2    0.153277
3   -0.676431
Name: data1, dtype: float64

In [68]:
people = pd.DataFrame(np.random.randn(5,5),
                      columns=['a','b','c','d','e'],
                      index = ['Joe','Steve','Wes','Jim','Travis'])

In [69]:
people.iloc[2:3,[1,2]] = np.nan

In [70]:
people

               a         b         c         d         e
Joe     0.627516 -1.154389 -1.533347 -0.395745  1.100433
Steve   0.328407  0.133175  0.681551 -1.183638 -1.057414
Wes     1.761379       NaN       NaN -0.701016 -1.748568
Jim     1.447183  1.040131 -2.261885  0.478141 -1.325851
Travis -1.182587 -1.134561  0.131498  0.081223 -0.655745

In [82]:
mapping = {'a':'red',
           'b':'red',
           'c':'blue',
           'd':'blue',
           'e':'red',
           'f':'orange'}

In [77]:
by_column = people.groupby(mapping,axis=0)

In [78]:
by_column.sum()

             a         b         c         d         e
blue  3.208562  1.040131 -2.261885 -0.222875 -3.074419
red  -0.226664 -2.155775 -0.720298 -1.498160 -0.612726

In [84]:
map_series = pd.Series(mapping)

In [85]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [86]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [90]:
newdf = pd.DataFrame(np.random.randn(15,4),
                     index=list('abcdacdeeadbcac'),
                     columns=pd.Index(list('ABCD'),name='types'))

In [94]:
newdf.groupby(mapping).mean()

types         A         B         C         D
blue  -0.039786 -0.449198  0.215666  0.119556
red   -0.064831  0.179446 -0.318290 -0.248693

In [95]:
people.groupby(len).sum()

          a         b         c         d         e
3  3.836078 -0.114258 -3.795233 -0.618620 -1.973986
5  0.328407  0.133175  0.681551 -1.183638 -1.057414
6 -1.182587 -1.134561  0.131498  0.081223 -0.655745

In [96]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],
                                    names=['cty','tenor'])
hier_df = pd.DataFrame(np.random.randn(4,5),columns=columns)

In [97]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.456744 -0.933569 -1.366293 -0.431951  1.118041
1      0.114248 -0.070060  0.119961 -1.425026 -0.064067
2     -0.260992 -0.734021 -0.380134  1.064169  0.034875
3     -0.948248 -1.058424  0.964096  0.974743  0.413324

In [102]:
hier_df.groupby(lambda x:'w' if x==('US',1) else 'e',axis=1).count()

   e  w
0  4  1
1  4  1
2  4  1
3  4  1

In [103]:
df

  key1 key2     data1     data2
0    a  one  0.745822  0.521047
1    a  two -0.225377 -2.100872
2    b  one  0.153277 -0.323817
3    b  two -0.676431 -1.235620
4    a  one  0.640857  0.222357

In [104]:
grouped = df.groupby('key1')

In [105]:
grouped['data1'].quantile(0.9)

key1
a    0.724829
b    0.070307
Name: data1, dtype: float64

In [133]:
def peak_to_peak(arr):
    return arr.max() - arr.min() if len(arr)>1 else np.NaN

In [117]:
grouped[['data1','data2']].agg(peak_to_peak,x=0,)

     data1 data2
key1
a      NaN   NaN
b      NaN   NaN

In [111]:
grouped.describe()['data1']

,count,mean,std,min,25%,50%,75%,max
key1,,,,,,,,
a,3.0,0.387101,0.533011,-0.225377,0.207740,0.640857,0.693339,0.745822
b,2.0,-0.261577,0.586692,-0.676431,-0.469004,-0.261577,-0.054150,0.153277

In [114]:
df.groupby(['key1','key2']).agg(peak_to_peak,)

              data1    data2
key1 key2
a    one   0.104965  0.29869
     two        NaN      NaN
b    one        NaN      NaN
     two        NaN      NaN

In [118]:
tips = pd.read_csv('../cha9/examples/tips.csv')

In [119]:
tips['tip_pct'] = tips['tip']/(tips['total_bill']-tips['tip'])

In [120]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.063204
1       10.34  1.66     No  Sun  Dinner     3  0.191244
2       21.01  3.50     No  Sun  Dinner     3  0.199886
3       23.68  3.31     No  Sun  Dinner     2  0.162494
4       24.59  3.61     No  Sun  Dinner     4  0.172069
5       25.29  4.71     No  Sun  Dinner     4  0.228863

In [121]:
grouped = tips.groupby(['day','smoker'])

In [122]:
grouped_pct = grouped['tip_pct']

In [126]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.179740
      Yes       0.216293
Sat   No        0.190412
      Yes       0.179833
Sun   No        0.193617
      Yes       0.322021
Thur  No        0.193424
      Yes       0.198508
Name: tip_pct, dtype: float64

In [138]:
grouped_pct.agg([('foo','mean'),('bar','std'),('peak to peak',peak_to_peak)],).swaplevel(0,1).sort_index()

                  foo       bar  peak to peak
smoker day
No     Fri   0.179740  0.039458      0.094263
       Sat   0.190412  0.058626      0.352192
       Sun   0.193617  0.060302      0.274897
       Thur  0.193424  0.056065      0.284273
Yes    Fri   0.216293  0.077530      0.242219
       Sat   0.179833  0.089496      0.446137
       Sun   0.322021  0.538061      2.382107
       Thur  0.198508  0.057170      0.219047

In [140]:
functions = ['count','mean','max']

In [143]:
result = grouped[['tip','total_bill']].agg(functions)

In [145]:
result.tip

             count      mean    max
day  smoker
Fri  No          4  2.812500   3.50
     Yes        15  2.714000   4.73
Sat  No         45  3.102889   9.00
     Yes        42  2.875476  10.00
Sun  No         57  3.167895   6.00
     Yes        19  3.516842   6.50
Thur No         45  2.673778   6.70
     Yes        17  3.030000   5.00

In [146]:
ftuples = [('Durchschnitt','mean'),('Abweichung',np.var)]

In [148]:
grouped[['tip_pct','total_bill']].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.179740   0.001557    18.420000   25.596333
     Yes        0.216293   0.006011    16.813333   82.562438
Sat  No         0.190412   0.003437    19.661778   79.908965
     Yes        0.179833   0.008010    21.276667  101.387535
Sun  No         0.193617   0.003636    20.506667   66.099980
     Yes        0.322021   0.289509    24.120000  109.046044
Thur No         0.193424   0.003143    17.113111   59.625081
     Yes        0.198508   0.003268    19.190588   69.808518

In [149]:
grouped.agg({'tip':np.max,
             'size':'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [151]:
grouped.agg({'tip_pct':['min','max','mean','std'],
             'size':'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.136861  0.231125  0.179740  0.039458    9
     Yes     0.115518  0.357737  0.216293  0.077530   31
Sat  No      0.060217  0.412409  0.190412  0.058626  115
     Yes     0.036955  0.483092  0.179833  0.089496  104
Sun  No      0.063204  0.338101  0.193617  0.060302  167
     Yes     0.070274  2.452381  0.322021  0.538061   49
Thur No      0.078704  0.362976  0.193424  0.056065  112
     Yes     0.098918  0.317965  0.198508  0.057170   40

In [170]:
def top(df, n=5,column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [171]:
top(tips)

     total_bill   tip smoker  day    time  size   tip_pct
183       23.17  6.50    Yes  Sun  Dinner     4  0.389922
232       11.61  3.39     No  Sat  Dinner     2  0.412409
67         3.07  1.00    Yes  Sat  Dinner     1  0.483092
178        9.60  4.00    Yes  Sun  Dinner     2  0.714286
172        7.25  5.15    Yes  Sun  Dinner     2  2.452381

In [166]:
tips.groupby('smoker').apply((top))

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.310180
       185       20.69  5.00     No   Sun  Dinner     5  0.318674
       51        10.29  2.60     No   Sun  Dinner     2  0.338101
       149        7.51  2.00     No  Thur   Lunch     2  0.362976
       232       11.61  3.39     No   Sat  Dinner     2  0.412409
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.387973
       183       23.17  6.50    Yes   Sun  Dinner     4  0.389922
       67         3.07  1.00    Yes   Sat  Dinner     1  0.483092
       178        9.60  4.00    Yes   Sun  Dinner     2  0.714286
       172        7.25  5.15    Yes   Sun  Dinner     2  2.452381

In [172]:
tips.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.166667
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.228833
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.115821
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.138160
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.133465
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.245038
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.083632
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.131199

In [183]:
tips.groupby('day').apply([top,peak_to_peak])

TypeError: unhashable type: 'list'

In [177]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [178]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.192237,0.057665,0.060217,0.158622,0.184308,0.227015,0.412409
Yes,93.0,0.218176,0.254295,0.036955,0.119534,0.181818,0.242326,2.452381

In [180]:
result.unstack()

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.192237
       Yes         0.218176
std    No          0.057665
       Yes         0.254295
min    No          0.060217
       Yes         0.036955
25%    No          0.158622
       Yes         0.119534
50%    No          0.184308
       Yes         0.181818
75%    No          0.227015
       Yes         0.242326
max    No          0.412409
       Yes         2.452381
dtype: float64

In [184]:
def top(df,n=5,columns='tip_pct'):
    return df.sort_values(by=columns)[-n:]

In [186]:
top(tips,n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.387973
183       23.17  6.50    Yes  Sun  Dinner     4  0.389922
232       11.61  3.39     No  Sat  Dinner     2  0.412409
67         3.07  1.00    Yes  Sat  Dinner     1  0.483092
178        9.60  4.00    Yes  Sun  Dinner     2  0.714286
172        7.25  5.15    Yes  Sun  Dinner     2  2.452381

In [187]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.310180
       185       20.69  5.00     No   Sun  Dinner     5  0.318674
       51        10.29  2.60     No   Sun  Dinner     2  0.338101
       149        7.51  2.00     No  Thur   Lunch     2  0.362976
       232       11.61  3.39     No   Sat  Dinner     2  0.412409
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.387973
       183       23.17  6.50    Yes   Sun  Dinner     4  0.389922
       67         3.07  1.00    Yes   Sat  Dinner     1  0.483092
       178        9.60  4.00    Yes   Sun  Dinner     2  0.714286
       172        7.25  5.15    Yes   Sun  Dinner     2  2.452381

In [189]:
tips.groupby('smoker').apply(lambda x:1)

smoker
No     1
Yes    1
dtype: int64

In [203]:
tips.groupby('smoker')[['total_bill','tip','size','tip_pct']].agg(pd.DataFrame.sum,axis=0)

        total_bill     tip   size    tip_pct
smoker
No         2897.43  451.77  403.0  29.027737
Yes        1930.34  279.81  224.0  20.290395

In [201]:
tips[['total_bill','tip','size','tip_pct']].sum(axis=1)

0      20.063204
1      15.191244
2      27.709886
3      29.152494
4      32.372069
         ...
239    38.206166
240    31.259428
241    26.766759
242    21.678899
243    23.970114
Length: 244, dtype: float64

In [204]:
tips.groupby(['smoker','day']).apply(top,n=1,columns='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.166667
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.228833
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.115821
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.138160
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.133465
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.245038
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.083632
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.131199

In [205]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [206]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.192237,0.057665,0.060217,0.158622,0.184308,0.227015,0.412409
Yes,93.0,0.218176,0.254295,0.036955,0.119534,0.181818,0.242326,2.452381

In [207]:
result.unstack()

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.192237
       Yes         0.218176
std    No          0.057665
       Yes         0.254295
min    No          0.060217
       Yes         0.036955
25%    No          0.158622
       Yes         0.119534
50%    No          0.184308
       Yes         0.181818
75%    No          0.227015
       Yes         0.242326
max    No          0.412409
       Yes         2.452381
dtype: float64

In [212]:
tips.groupby('smoker',as_index=False).apply(top)

       total_bill   tip smoker   day    time  size   tip_pct
0 88        24.71  5.85     No  Thur   Lunch     2  0.310180
  185       20.69  5.00     No   Sun  Dinner     5  0.318674
  51        10.29  2.60     No   Sun  Dinner     2  0.338101
  149        7.51  2.00     No  Thur   Lunch     2  0.362976
  232       11.61  3.39     No   Sat  Dinner     2  0.412409
1 109       14.31  4.00    Yes   Sat  Dinner     2  0.387973
  183       23.17  6.50    Yes   Sun  Dinner     4  0.389922
  67         3.07  1.00    Yes   Sat  Dinner     1  0.483092
  178        9.60  4.00    Yes   Sun  Dinner     2  0.714286
  172        7.25  5.15    Yes   Sun  Dinner     2  2.452381

In [213]:
frame = pd.DataFrame({'data1':np.random.randn(1000),
                      'data2':np.random.randn(1000)})

In [214]:
quartiles = pd.cut(frame.data1,bins=4)

In [215]:
quartiles[:10]

0    (-1.415, 0.0385]
1     (0.0385, 1.493]
2    (-2.875, -1.415]
3    (-2.875, -1.415]
4     (0.0385, 1.493]
5    (-1.415, 0.0385]
6    (-1.415, 0.0385]
7     (0.0385, 1.493]
8    (-2.875, -1.415]
9    (-1.415, 0.0385]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-2.875, -1.415] < (-1.415, 0.0385] < (0.0385, 1.493] < (1.493, 2.947]]

In [216]:
def get_stats(group):
    return {'min':group.min(),
            'max':group.max(),
            'count':group.count(),
            'mean':group.mean()}

In [217]:
grouped = frame.groupby(quartiles)

In [222]:
grouped['data2'].apply(get_stats).unstack()

                       min       max  count      mean
data1
(-2.875, -1.415] -1.634067  2.350927   68.0  0.059641
(-1.415, 0.0385] -3.103323  3.058644  449.0  0.005277
(0.0385, 1.493]  -2.974236  3.319628  410.0 -0.073721
(1.493, 2.947]   -2.332138  2.271768   73.0  0.162439

In [220]:
frame

        data1     data2
0   -1.181361  0.676814
1    1.466616 -0.955497
2   -1.470402 -0.547501
3   -1.453165  1.227159
4    0.280457  0.617881
..        ...       ...
995  0.287056  0.207688
996  1.072884 -0.189648
997 -0.477560 -1.343572
998  1.157673 -1.272352
999 -0.076357 -0.084135

[1000 rows x 2 columns]

In [230]:
grouping = pd.qcut(frame.data1,10)

In [231]:
frame.data1

0     -1.181361
1      1.466616
2     -1.470402
3     -1.453165
4      0.280457
         ...
995    0.287056
996    1.072884
997   -0.477560
998    1.157673
999   -0.076357
Name: data1, Length: 1000, dtype: float64

In [232]:
grouped = frame.data2.groupby(grouping)

In [235]:
grouped.apply(get_stats).unstack()

                         min       max  count      mean
data1
(-2.871, -1.216]   -1.659654  3.035578  100.0  0.083741
(-1.216, -0.75]    -2.100562  1.911068  100.0  0.002646
(-0.75, -0.473]    -2.464728  2.150586  100.0 -0.184134
(-0.473, -0.246]   -3.103323  2.702124  100.0  0.054384
(-0.246, -0.00632] -2.706301  3.058644  100.0  0.087414
(-0.00632, 0.246]  -2.974236  1.927204  100.0 -0.052971
(0.246, 0.492]     -2.747651  3.319628  100.0 -0.082039
(0.492, 0.774]     -2.178769  2.484746  100.0  0.045054
(0.774, 1.215]     -2.316606  2.905374  100.0 -0.199317
(1.215, 2.947]     -2.463007  2.271768  100.0  0.125797

In [234]:
grouping

0         (-1.216, -0.75]
1          (1.215, 2.947]
2        (-2.871, -1.216]
3        (-2.871, -1.216]
4          (0.246, 0.492]
              ...
995        (0.246, 0.492]
996        (0.774, 1.215]
997       (-0.75, -0.473]
998        (0.774, 1.215]
999    (-0.246, -0.00632]
Name: data1, Length: 1000, dtype: category
Categories (10, interval[float64, right]): [(-2.871, -1.216] < (-1.216, -0.75] < (-0.75, -0.473] < (-0.473, -0.246] ... (0.246, 0.492] < (0.492, 0.774] < (0.774, 1.215] < (1.215, 2.947]]

In [236]:
s = pd.Series(np.random.randn(6))

In [237]:
s[::2] = np.nan

In [238]:
s

0         NaN
1    0.269389
2         NaN
3    1.057648
4         NaN
5   -0.027216
dtype: float64

In [239]:
s.fillna(s.mean())

0    0.433274
1    0.269389
2    0.433274
3    1.057648
4    0.433274
5   -0.027216
dtype: float64

In [240]:
states = ['Ohio','New York','Vermont','Floroda','Oregon','Nevada','California','Idaho']

In [241]:
group_key = ['East']*4 + ['West']*4

In [242]:
data=pd.Series(np.random.randn(8),index=states)

In [243]:
data

Ohio          0.058311
New York      0.155634
Vermont      -0.406341
Floroda       1.076543
Oregon       -1.465571
Nevada        0.125520
California   -0.733083
Idaho        -0.096025
dtype: float64

In [244]:
data[['Vermont','Nevada','Idaho']] = np.nan

In [245]:
data

Ohio          0.058311
New York      0.155634
Vermont            NaN
Floroda       1.076543
Oregon       -1.465571
Nevada             NaN
California   -0.733083
Idaho              NaN
dtype: float64

In [246]:
data.groupby(group_key).mean()

East    0.430163
West   -1.099327
dtype: float64

In [247]:
fill_mean = lambda g:g.fillna(g.mean())

In [248]:
data.groupby(group_key).apply(fill_mean)

East  Ohio          0.058311
      New York      0.155634
      Vermont       0.430163
      Floroda       1.076543
West  Oregon       -1.465571
      Nevada       -1.099327
      California   -0.733083
      Idaho        -1.099327
dtype: float64

In [249]:
suit = ['H','S','C','D']

In [250]:
card_val = (list(range(1,11))+[10]*3)*4

In [251]:
base_names = ['A'] + list(range(2,11))+['J','K','Q']

In [252]:
cards = []

In [253]:
for suit in ['H','S','C','D']:
    cards.extend(str(num)+suit for num in base_names)
deck = pd.Series(card_val,index=cards)

In [255]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [256]:
def draw(deck,n=5):
    return deck.sample(n)

In [257]:
draw(deck)

9S     9
QS    10
AD     1
AS     1
5C     5
dtype: int64

In [258]:
get_suit = lambda card: card[-1]

In [260]:
deck.groupby(get_suit).apply(draw,n=2)

C  6C      6
   10C    10
D  9D      9
   KD     10
H  8H      8
   10H    10
S  JS     10
   AS      1
dtype: int64

In [261]:
deck.groupby(get_suit,group_keys=False).apply(draw,n=2)

8C      8
QC     10
JD     10
10D    10
AH      1
6H      6
AS      1
5S      5
dtype: int64

In [262]:
ddf = pd.DataFrame({'category':['a']*4+['b']*4,
                    'data' : np.random.randn(8),
                    'weight':np.random.rand(8)})

In [263]:
ddf

  category      data    weight
0        a -0.524181  0.549930
1        a  1.580366  0.622780
2        a  0.863456  0.159228
3        a  2.117796  0.664445
4        b -0.032983  0.781594
5        b  0.898044  0.332409
6        b -1.387745  0.807000
7        b -0.865841  0.303123

In [264]:
grouped = ddf.groupby('category')

In [265]:
get_wavg = lambda g: np.average(g.data,weights=g.weight)

In [266]:
grouped.apply(get_wavg)

category
a    1.122331
b   -0.498905
dtype: float64

In [267]:
close_px = pd.read_csv('example/stock_px.csv',parse_dates=True,index_col=0)

In [268]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [269]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [270]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [276]:
rets = close_px.pct_change().dropna()

In [278]:
get_year = lambda x: x.year

In [280]:
by_year = rets.groupby(get_year)

In [281]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [285]:
change_rets = close_px.pct_change().dropna()

In [292]:
change_rets.groupby(lambda x: x.year).apply(lambda x:x['AAPL'].corr(x.MSFT))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [293]:
import statsmodels.api as sm

In [294]:
def regress(data,yvar,xvar):
    Y = data[yvar]
    X = data[xvar]
    X['intercept'] =1.
    result = sm.OLS(Y,X).fit()
    return result.params

In [295]:
by_year.apply(regress,'AAPL',['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [303]:
tips.pivot_table(index=['day','smoker'])

TypeError: Could not convert DinnerDinnerDinnerLunch to numeric

In [311]:
tips.drop('time',axis=1).pivot_table(index=['day','smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.179740   18.420000
     Yes     2.066667  2.714000  0.216293   16.813333
Sat  No      2.555556  3.102889  0.190412   19.661778
     Yes     2.476190  2.875476  0.179833   21.276667
Sun  No      2.929825  3.167895  0.193617   20.506667
     Yes     2.578947  3.516842  0.322021   24.120000
Thur No      2.488889  2.673778  0.193424   17.113111
     Yes     2.352941  3.030000  0.198508   19.190588

In [310]:
tips.drop('time',axis=1)

     total_bill   tip smoker   day  size   tip_pct
0         16.99  1.01     No   Sun     2  0.063204
1         10.34  1.66     No   Sun     3  0.191244
2         21.01  3.50     No   Sun     3  0.199886
3         23.68  3.31     No   Sun     2  0.162494
4         24.59  3.61     No   Sun     4  0.172069
..          ...   ...    ...   ...   ...       ...
239       29.03  5.92     No   Sat     3  0.256166
240       27.18  2.00    Yes   Sat     2  0.079428
241       22.67  2.00    Yes   Sat     2  0.096759
242       17.82  1.75     No   Sat     2  0.108899
243       18.78  3.00     No  Thur     2  0.190114

[244 rows x 6 columns]

In [312]:
tips.pivot_table(['tip_pct','size'],index=['time','day'],columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.162612  0.202545
       Sat   2.555556  2.476190  0.190412  0.179833
       Sun   2.929825  2.578947  0.193617  0.322021
       Thur  2.000000       NaN  0.190114       NaN
Lunch  Fri   3.000000  1.833333  0.231125  0.236915
       Thur  2.500000  2.352941  0.193499  0.198508

In [313]:
tips.pivot_table(['tip_pct','size'],index=['time','day'],columns='smoker',margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.162612  0.202545  0.192562
       Sat   2.555556  2.476190  2.517241  0.190412  0.179833  0.185305
       Sun   2.929825  2.578947  2.842105  0.193617  0.322021  0.225718
       Thur  2.000000       NaN  2.000000  0.190114       NaN  0.190114
Lunch  Fri   3.000000  1.833333  2.000000  0.231125  0.236915  0.236088
       Thur  2.500000  2.352941  2.459016  0.193499  0.198508  0.194895
All          2.668874  2.408602  2.569672  0.192237  0.218176  0.202123

In [315]:
tips.pivot_table('tip_pct',index=['time','smoker'],columns='day',aggfunc=len)

day            Fri   Sat   Sun  Thur
time   smoker
Dinner No      3.0  45.0  57.0   1.0
       Yes     9.0  42.0  19.0   NaN
Lunch  No      1.0   NaN   NaN  44.0
       Yes     6.0   NaN   NaN  17.0

In [324]:
tips.pivot_table('tip_pct',index=['time','size','smoker'],columns='day',aggfunc='mean',observed=False)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No           NaN  0.160000       NaN       NaN
            Yes          NaN  0.483092       NaN       NaN
       2    No      0.162612  0.198319  0.206535  0.190114
            Yes     0.211180  0.178877  0.400522       NaN
       3    No           NaN  0.183870  0.182962       NaN
            Yes          NaN  0.176599  0.183278       NaN
       4    No           NaN  0.177734  0.175289       NaN
            Yes     0.133465  0.147074  0.254373       NaN
       5    No           NaN       NaN  0.263344       NaN
            Yes          NaN  0.119284  0.070274       NaN
       6    No           NaN       NaN  0.115821       NaN
Lunch  1    No           NaN       NaN       NaN  0.222087
            Yes     0.288288       NaN       NaN       NaN
       2    No           NaN       NaN       NaN  0.201503
            Yes     0.226641       NaN       NaN  0.191197
       3    No      0.231125       NaN       NaN  0.092162
            Yes          NaN       NaN       NaN  0.257941
       4    No           NaN       NaN       NaN  0.161573
            Yes          NaN       NaN       NaN  0.186592
       5    No           NaN       NaN       NaN  0.138160
       6    No           NaN       NaN       NaN  0.211191

In [322]:
tips.pivot_table(index='smoker',columns='day',values='size',observed=True,)

day          Fri       Sat       Sun      Thur
smoker
No      2.250000  2.555556  2.929825  2.488889
Yes     2.066667  2.476190  2.578947  2.352941

In [325]:
data

Ohio          0.058311
New York      0.155634
Vermont            NaN
Floroda       1.076543
Oregon       -1.465571
Nevada             NaN
California   -0.733083
Idaho              NaN
dtype: float64

In [329]:
R = 'Right-handed'
L = 'Left-handed'
data = pd.DataFrame({'Sample':np.arange(1,11),
                     'Nationality':['USA','Japan','USA','Japan','Japan','Japan',
                                    'USA','USA','Japan','USA'],
                     'Handedness':[R,L,R,R,L,R,R,L,R,R]}
                     )

In [330]:
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [332]:
pd.crosstab(data.Nationality,data.Handedness,margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [333]:
data.pivot_table(index='Nationality',columns='Handedness',aggfunc='count',margins=True)

                 Sample
Handedness  Left-handed Right-handed All
Nationality
Japan                 2            3   5
USA                   1            4   5
All                   3            7  10

In [334]:
pd.crosstab([tips.time,tips.day],tips.smoker,margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244